[
	{
		"title": "MIQP-based Layout Design for Building Interiors",
		"authors": [{
				"fullName": "Wenming Wu",
				"url": "/",
				"afflID": [0, 1]
			},
			{
				"fullName": "Lubin Fan",
				"url": "/",
				"afflID": [0]
			},
			{
				"fullName": "Ligang Liu",
				"url": "http://staff.ustc.edu.cn/~lgliu/",
				"afflID": [1]
			},
			{
				"fullName": "Peter Wonka",
				"url": "http://peterwonka.net/",
				"afflID": [0]
			}
		],
		"affiliations": [{
				"name": "King Abdullah University of Science and Technology",
				"url": "http://www.kaust.edu.sa/index.html"
			},
			{
				"name": "University of Science and Technology of China",
				"url": "http://en.ustc.edu.cn/"
			}
		],
		"event": "Computer Grahpics Forum (Proc. of Eurographics 2018)",
		"abstract": "We propose a hierarchical framework for the generation of building interiors. Our solution is based on a mixed integer quadratic programming (MIQP) formulation. We parametrize a layout by polygons that are further decomposed into small rectangles. We identify important high-level constraints, such as room size, room position, room adjacency, and the outline of the building, and formulate them in a way that is compatible with MIQP and the problem parametrization. We also propose a hierarchical framework to improve the scalability of the approach. We demonstrate that our algorithm can be used for residential building layouts and can be scaled up to large layouts such as office buildings, shopping malls, and supermarkets. We show that our method is faster by multiple orders of magnitude than previous methods.",
		"contents": [{
				"name": "",
				"images": [{
					"type":"Figure 1",
					"uri": "images/publications/2018-eg-iplayout/teaser.png",
					"caption": "We propose a framework that generates building interiors with high-level constraints, e.g., room size, room position, room adjacency, and the outline of the building. (a) The layout of a two-storey house and corresponding 3D renderings. (b) A large-scale example depicting an office building. For such large-scale layouts, our method is faster by multiple orders of magnitude than previous methods."
				}]
			},
			{
				"name": "Overview",
				"images": [{
					"type":"Figure 2",
					"uri": "images/publications/2018-eg-iplayout/overview.png",
					"caption": "Overview of our framework. Given a list of high-level constraints and an outline as input (Input), we compute a layout using a hierarchical framework. Level 1 shows an initial layout and Level 2 shows the layout including local refinements. Finally, additional details can be added to visualize the results as architectural floorplans or 3D models."
				}]
			},
			{
				"name": "Results",
				"images": [{
					    "type":"Figure 3",
						"uri": "images/publications/2018-eg-iplayout/results.png",
						"caption": "Two apartment layouts are generated by our algorithm with the same input. Boundary constraints are added for bedrooms to ensure that all bedrooms receive sufficient sunshine from the south east direction. The north direction is shown."
					},
					{ 
						"type":"Figure 4",
						"uri": "images/publications/2018-eg-iplayout/hierarchical.png",
						"caption": "Pipeline of the hierarchical framework. (a) Starting from the empty layout domain with the door position and two obstacles, our method generates (b) an interior layout on the first level according to the user-specified high-level constraints. There is a region (shown in red) that is not covered by any room. (c) Our algorithm automatically selects the sub-domain (highlighted as the red polygon) for the optimization on the next level. (d) Then, the sub-domain is initialized with small rectangles and constraints are updated. (e) The new layout is generated in the sub-domain (i.e.,red polygon). The user specifies the study room (blue rectangle) for further improvement. (f) The final result."
					},
					{
						"type":"Figure 5",
						"uri": "images/publications/2018-eg-iplayout/mall.png",
						"caption": "An interior layout of a shopping mall is generated by our hierarchical framework. (a) Starting from an empty layout domain with obstacles. (b) First, we generate the layouts for five regions shown in different colors. (c) Then aisles are generated by expanding the gap between two regions with a fixed width. (d) Next, we generate the layouts inside each region. (e-h) We repeat this procedure to get (i) the final layout. The number of objects (regions and rooms) and constraints on each level are specified by the user."
					}
				]
			}
		],
		"videos": [
		{
			"imageUri":"",
			"caption": [
			{
				"title":"Youku",
				"uri":""
			},
			{
				"title":"YouTube",
				"uri":""
			}
			]
		}
		],
		"acknowlegement": "This work was supported by the KAUST Office of Sponsored Research (OSR) under Award No. OCRF-2014-CGR3-62140401, and the Visual Computing Center at KAUST. Ligang Liu is supported by the National Natural Science Foundation of China (61672482, 61672481, 11626253) and the One Hundred Talent Project of the Chinese Academy of Sciences. We would like to thank Virginia Unkefer for proofreading the paper.",
		"bibtex": {
			"type": "article",
			"name": "Fan:2018:IPLayout",
			"title": "MIQP-based Layout Design for Building Interiors",
			"author": "Wenming Wu and Lubin Fan and Ligang Liu and Peter Wonka",
			"journel": "Computer Grahpics Forum",
			"volume": "37",
			"number": "2",
			"pages": "511--521",
			"year": "2018"
		},
		"materials": [{
				"iconUri": "images/icons/pdf_wh64.png",
				"matUri": "https://lbfan.oss-cn-hangzhou.aliyuncs.com/personal_webpage/publications/2018-eg-iplayout.hres.pdf",
				"caption": "Paper (108.1MB)"
			},
			{
				"iconUri": "images/icons/pdf_wh64.png",
				"matUri": "https://lbfan.oss-cn-hangzhou.aliyuncs.com/personal_webpage/publications/2018-eg-iplayout.suppl.pdf",
				"caption": "Additional Materials (3.37MB)"
			},
			{
				"iconUri": "images/icons/video_wh64.png",
				"matUri": "",
				"caption": "Video"
			}
		]
	}
]